[
  {
    "text": "Phần mềm gồm",
    "numOfRightAnswer": 3,
    "answers": [
      "Chương trình máy tính",
      "Cấu trúc dữ liệu (ngoài và trong)",
      "Tài liệu",
      "Thiết bị vào ra"
    ],
    "image": null
  },
  {
    "text": "Chọn phát biểu đúng nhất về hệ thống thông tin (HTTT).",
    "numOfRightAnswer": 1,
    "answers": [
      "HTTT gồm phần cứng và cơ sở hạ tầng mạng truyền thông, phần mềm, dữ liệu, con người và các quy trình đảm bảo HTTT được sử dụng hiệu quả và có khả năng bảo trì.",
      "HTTT là về phần cứng và cơ sở hạ tầng mạng truyền thông.",
      "HTTT chính là tên gọi khác của phần mềm.",
      "HTTT là một thành phần quan trọng của phần mềm"
    ],
    "image": null
  },
  {
    "text": "Chọn phát biểu đúng nhất về mối quan hệ giữa phần mềm và hệ thống thông tin (HTTT).",
    "numOfRightAnswer": 1,
    "answers": [
      "Phần mềm là một thành phần quan trọng của HTTT",
      "HTTT là về phần cứng và cơ sở hạ tầng mạng truyền thông. Phần mềm được xây dựng trên nền tảng của HTTT",
      "Hai khái niệm này có cùng ý nghĩa",
      "HTTT là một thành phần quan trọng của phần mềm"
    ],
    "image": null
  },
  {
    "text": "Đâu không là lợi ích của việc quản lý dự án tốt?",
    "numOfRightAnswer": 1,
    "answers": [
      "Vồn đầu tư thấp",
      "Thời gian phát triển ngắn",
      "Tinh thần làm việc của các thành viên cao",
      "Lợi nhuận thu được cao"
    ],
    "image": null
  },
  {
    "text": "Các tiêu chí để đo sự thành công của một dự án gồm:",
    "numOfRightAnswer": 3,
    "answers": ["Phạm vi của dự án ", "Thời gian hoàn thành", "Kinh phí"],

    "image": null
  },
  {
    "text": "Ngày nay, việc quản lý dự án bị giảm tầm quan trọng do hầu hết các dự án đều thành công và hoàn thành đúng hạn.    ",
    "numOfRightAnswer": 1,
    "answers": ["Sai", "Đúng "],
    "image": null
  },
  {
    "text": "Đâu không là thuộc tính của một dự án?",
    "numOfRightAnswer": 1,
    "answers": [
      "Dự án có ít yếu tố không rõ ràng",
      "Mỗi dự án là duy nhất",
      "Dự án được triển khai bằng một quy trình công phu",
      "Dự án có một nhà đầu tư chính"
    ],
    "image": null
  },
  {
    "text": "Đâu không là một trong ba ràng buộc của quản lý dự án?",
    "numOfRightAnswer": 1,
    "answers": ["Giao tiếp", "Phạm vi dự án", "Thời gian", "Chi phí"],
    "image": null
  },
  {
    "text": "Đâu không là một trong mười kỹ năng hàng đầu của một quản lý dự án giỏi?",
    "numOfRightAnswer": 1,
    "answers": [
      "Thành thạo công nghệ",
      "Kỹ năng lãnh đạo",
      "Kỹ năng quản lý nhân sự",
      "Quyết đoán, đáng tin cậy"
    ],
    "image": null
  },
  {
    "text": "Đâu không là một trong mười miền tri thức của quản lý dự án",
    "numOfRightAnswer": 1,
    "answers": [
      "Quản lý công nghệ",
      "Quản lý phạm vi",
      "Quản lý các bên liên quan",
      "Quản lý thời gian"
    ],
    "image": null
  },
  {
    "text": "Đâu là bộ bốn miền tri thức chủ chốt trong mười miền tri thức của quản lý dự án",
    "numOfRightAnswer": 1,
    "answers": [
      "Quản lý phạm vi, quản lý thời gian, quản lý chi phí và quản lý chất lượng",
      "Quản lý phạm vi, quản lý thời gian, quản lý các bên liên quan và quản lý nguồn nhân lực",
      "Quản lý giao tiếp, quản lý rủi ro, quản lý thay đổi và cấu hình, quản lý tích hợp",
      "Quản lý phạm vi, quản lý thời gian, quản lý nguồn nhân lực và quản lý chất lượng"
    ],
    "image": null
  },
  {
    "text": "Đâu là bộ tiêu chí khó nhất mà một dự án có thể đạt được",
    "numOfRightAnswer": 1,
    "answers": [
      "Tất cả các bên liên quan đều hài lòng",
      "Thỏa mãn phạm vi, thời gian và kinh phí",
      "Thỏa mãn khách hàng và chủ đầu tư",
      "Cả ba bộ tiêu chí này tương đương nhau"
    ],
    "image": null
  },
  {
    "text": "Đâu không là giải pháp khả thi nhất trong việc hạn chế các vấn đề liên quan đến phạm vi của dự án CNTT?",
    "numOfRightAnswer": 1,
    "answers": [
      "Hạn chế sự liên quan đến nhiều người dùng/khách hàng trong quản lý phạm vi",
      "Cố gắng xác định phạm vi cụ thể/rõ ràng nhất có thể",
      "Sử dụng các phần cứng và phần mềm thương mại hóa khi có thể",
      "Tuân theo các quy trình tốt về quản lý dự án"
    ],
    "image": null
  },
  {
    "text": "Đâu không là một giải pháp để xác định chính xác đầu vào của hệ thống?",
    "numOfRightAnswer": 1,
    "answers": [
      "Chỉ họp nếu cần thiết, không cần quá thường xuyên và định kỳ",
      "Phát triển một quy trình tốt để lựa chọn dự án",
      "Huy động khách hàng tham gia vào đội dự án",
      "Gắn chặt mối quan hệ giữa khách hàng và người phát triển"
    ],
    "image": null
  },
  {
    "text": "........ là một sản phẩm hoặc dịch vụ, hoặc các phần cứng được tạo ra hoặc cung cấp từ dự án.",
    "numOfRightAnswer": 1,
    "answers": [
      "Sản phẩm chuyển giao",
      "Gói công việc",
      "Các sản phẩm sinh ra từ dự án",
      "Tài liệu của dự án"
    ],
    "image": null
  },
  {
    "text": "Bản chất của các dự án công nghệ thông tin thường khác biệt so với các dự án trong các lĩnh vực khác bởi vì chúng rất là ........",
    "numOfRightAnswer": 1,
    "answers": [
      "Đa dạng và phức tạp",
      "Đắt đỏ",
      "Thách thức",
      "Đòi hỏi kỹ thuật cao"
    ],
    "image": null
  },
  {
    "text": "Tiến trình nào sau đây không phải là một phần của khâu quản lý tích hợp dự án (project integration management)?",
    "numOfRightAnswer": 1,
    "answers": [
      "Xác định nghiệp vụ dự án",
      "Xây dựng điều lệ/hiến chương dự án (project charter)",
      "Xây dựng kế hoạch quản lý dự án",
      "Xây dựng kế hoạch quản lý rủi ro"
    ],
    "image": null
  },
  {
    "text": "Chọn phát biểu đúng nhất về thực trạng của các dự án CNTT ở nước ta.",
    "numOfRightAnswer": 3,
    "answers": [
      "Nhỏ lẻ, manh mún, thiếu thiết kế tổng thể, …",
      "Các phần mềm trong một cơ quan không giao tiếp được với nhau",
      "Chất lượng thấp (Không đủ chức năng, khó sử dụng, thiếu tài liệu, nhiều lỗi, khó bảo trì, …)",
      "Hiện đại đáp ứng được nhu cầu với thế giới"
    ],
    "image": null
  }
]
