[
    {
        "text": "Phát biểu nào là đúng?",
        "numOfRightAnswer": 1,
        "answers": [
            "UML là ngôn ngữ lập mô hình cho bản thiết kế phần mềm",
            "UML là một quy trình phát triển cho các hệ thống phần mềm chuyên sâu",
            "UML là ngôn ngữ phụ thuộc vào quá trình được sử dụng để hiển thị các tạo phẩm phần mềm",
            "UML là ngôn ngữ lập trình trực quan"
        ],
        "image": null
    },
    {
        "text": "Chỉ ra ba cách mà một lớp có cấu trúc khác với một lớp truyền thống? (Chọn ba)",
        "numOfRightAnswer": 3,
        "answers": [
            "Nó xác định rõ ràng ranh giới lớp thông qua lớp vỏ đóng gói",
            "Nó mang giao diện công cộng vào lớp thông qua các cổng",
            "Nó cho thấy vai trò của lớp",
            "Nó định nghĩa các thông điệp giữa chính nó và các lớp khác"
        ],
        "image": null
    },
    {
        "text": "Đâu là một đặc điểm của một lớp có cấu trúc?",
        "numOfRightAnswer": 1,
        "answers": [
            "có thể đóng nhiều vai trò khác nhau trên các đối tượng tương tác với nó",
            "phải có một giao diện cho mỗi vai trò",
            "chỉ có thể đóng một vai trò, bất kể có bao nhiêu đối tượng giao dịch với nó",
            "bị giới hạn ở một vai trò, nhưng có thể có nhiều giao diện"
        ],
        "image": null
    },
    {
        "text": "Phát biểu nào là đúng về quy trình phát triển lặp?",
        "numOfRightAnswer": 1,
        "answers": [
            "Kiểm tra và tích hợp diễn ra trong mỗi lần lặp.",
            "Lặp lại tập trung vào việc hoàn thành một phần các thực hiện trường hợp sử dụng đã chọn.",
            "Nó khuyến khích phản hồi của người dùng trong các lần lặp lại sau.",
            "Nó dựa trên sự phân hủy chức năng của một hệ thống."
        ],
        "image": null
    },
    {
        "text": "Hai câu nào đúng về giao diện? (Chọn hai)",
        "numOfRightAnswer": 2,
        "answers": [
            "Một giao diện duy nhất nên bao gồm càng nhiều phương thức có thể, nếu không phải tất cả các phương thức, có thể được chia sẻ bởi các đối tượng thực hiện giao diện.",
            "Các lớp có thể có nhiều giao diện tùy thuộc vào mục đích của từng giao diện mà nó thực hiện",
            "Giao diện nên có mục đích rõ ràng.",
            "Một giao diện nên được sử dụng để hạn chế phương thức nào được tiếp xúc với máy khách(client)."
        ],
        "image": null
    },
    {
        "text": "Trọng tâm của phân tích là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "Chuyển các yêu cầu chức năng thành các khái niệm phần mềm",
            "Chuyển các yêu cầu thành một thiết kế hệ thống",
            "Chuyển các yêu cầu chức năng thành mã",
            "Chuyển các khái niệm trong thế giới thực sang các đối tượng hướng đến giải pháp"
        ],
        "image": null
    },
    {
        "text": "Tại sao đóng gói lại quan trọng? (Chọn hai)",
        "numOfRightAnswer": 2,
        "answers": [
            "Nó đặt các hoạt động và thuộc tính trong cùng một đối tượng.",
            "Nó ngăn các đối tượng khác thay đổi trực tiếp các thuộc tính của một đối tượng",
            "Nó mô tả mối quan hệ giữa hai lớp con.",
            "Nó cho phép các đối tượng khác thay đổi các hoạt động và thuộc tính riêng tư của một đối tượng."
        ],
        "image": null
    },
    {
        "text": "Lớp phân tích là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "những phỏng đoán ban đầu về thành phần của hệ thống thường thay đổi theo thời gian, hiếm khi còn tồn tại nguyên vẹn khi thực hiện",
            "các lớp không đầy đủ yêu cầu lập trình viên chính thức hóa chữ ký hoạt động và các loại thuộc tính trước khi chúng có thể được thực hiện",
            "các lớp bên trong một Hệ thống Đối tượng Kinh doanh hoặc Mô hình Miền, ở dạng UML",
            "một nguyên mẫu của giao diện người dùng hệ thống, được phát triển trong Giai đoạn Phân tích, cho phép người dùng xác định giao diện hệ thống"
        ],
        "image": null
    },
    {
        "text": "Một kiến trúc sư nhìn vào hai lớp. Lớp đầu tiên có các hoạt động sau: getName (), getSize (), getTotal () và findAlusive (). Lớp thứ hai có các hoạt động sau: getName (), getSize (), findAlusive (), findMinimum () và findMaximum (). Hai lớp chia sẻ cùng một siêu lớp(superclass). Những hoạt động có nhiều khả năng có trong siêu lớp?",
        "numOfRightAnswer": 1,
        "answers": [
            "getName (), getSize () và findAlusive ()",
            "findMaximum (), findMinimum (), getSize () và getTotal ()",
            "getName (), findAlusive () và findMaximum ()",
            "getName (), getSize (), getTotal () và findAlusive ()"
        ],
        "image": null
    },
    {
        "text": "Một kiến trúc sư chịu trách nhiệm tạo Mô hình Phân tích cho một hệ thống. Khu vực trọng tâm nào là cần thiết cho việc tạo ra mô hình này?",
        "numOfRightAnswer": 1,
        "answers": [
            "hành vi của các đối tượng bao gồm hệ thống",
            "phần cứng mà hệ thống sẽ được triển khai",
            "sự phát triển của các lớp phân tích thành các lớp thiết kế",
            "yêu cầu hiệu năng của hệ thống"
        ],
        "image": null
    },
    {
        "text": "Giao diện cần thiết làm gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "sử dụng các dịch vụ mà trình phân loại yêu cầu từ các nhà cung cấp ẩn danh",
            "trưng bày dịch vụ cho người yêu cầu ẩn danh",
            "tuyên bố các dịch vụ mà bộ phân loại cung cấp để cung cấp cho người yêu cầu ẩn danh",
            "phơi bày các phương thức mà người yêu cầu phải sử dụng"
        ],
        "image": null
    },
    {
        "text": "Trong sơ đồ trình tự, mỗi tương tác trên sơ đồ ánh xạ tới _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "sự chuyển đổi trên biểu đồ trạng thái",
            "một điểm lựa chọn trên biểu đồ trạng thái",
            "một trạng thái trên biểu đồ",
            "trạng thái ban đầu"
        ],
        "image": null
    },
    {
        "text": "Hai câu hỏi nào về việc sử dụng bội số trên các mối quan hệ cho phép bạn trả lời? (Chọn hai.)",
        "numOfRightAnswer": 2,
        "answers": [
            "Mối quan hệ là bắt buộc hay không bắt buộc?",
            "Có bao nhiêu liên kết một đối tượng có thể duy trì với các đối tượng thuộc loại khác?",
            "Một đối tượng thuộc một loại nhất định có được phép tương tác với các đối tượng thuộc loại khác không?",
            "Mối quan hệ giữa các đối tượng là vĩnh viễn hay tạm thời?"
        ],
        "image": null
    },
    {
        "text": "Hai lưu ý quan trọng khi lập sơ đồ trạng thái là gì? (Chọn hai.)",
        "numOfRightAnswer": 2,
        "answers": [
            "Bất cứ khi nào nhận được tin nhắn; có thể có một sự thay đổi của nhà nước",
            "Bất cứ khi nào có sự thay đổi trạng thái, có sự chuyển đổi.",
            "Bất cứ khi nào nhận được tin nhắn; phải có sự thay đổi trạng thái",
            "Thay đổi trạng thái có thể không thay đổi quá trình chuyển đổi."
        ],
        "image": null
    },
    {
        "text": "Phát biểu nào là đúng về phụ thuộc vòng tròn?",
        "numOfRightAnswer": 1,
        "answers": [
            "Chúng phải được tránh.",
            "Họ không quan trọng.",
            "Họ bị cấm.",
            "Khi có nhiều hơn hai gói, chúng không liên quan."
        ],
        "image": null
    },
    {
        "text": "Mục đích của phân tích kiến trúc là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "để xác định kiến trúc ứng cử viên cho hệ thống",
            "để chi tiết thiết kế của hệ thống",
            "để xem xét kiến trúc của hệ thống",
            "để xác định các lớp của kiến trúc"
        ],
        "image": null
    },
    {
        "text": "Khi các giao diện giữa hai lớp được xác định từ sơ đồ tuần tự, các cổng được xác định bởi _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "giao diện",
            "các hoạt động mà lớp thực hiện",
            "người dùng hệ thống",
            "các thuộc tính được truyền trong sơ đồ trình tự"
        ],
        "image": null
    },
    {
        "text": "Phát biểu nào là đúng về các thuộc tính?",
        "numOfRightAnswer": 1,
        "answers": [
            "Chúng thay đổi giá trị từ đối tượng sang đối tượng cùng lớp.",
            "Chúng không thể thay đổi một khi đối tượng được khởi tạo.",
            "Chúng chỉ có thể là nguyên thủy.",
            "Chúng được yêu cầu cho mọi lớp học."
        ],
        "image": null
    },
    {
        "text": "Ba mục đích của Phân tích và Thiết kế là gì? (Chọn ba.)",
        "numOfRightAnswer": 3,
        "answers": [
            "để biến đổi các yêu cầu thành một thiết kế của hệ thống tương lai",
            "để phát triển một kiến trúc mạnh mẽ cho hệ thống",
            "để điều chỉnh thiết kế cho phù hợp với môi trường thực hiện",
            "để cung cấp một bối cảnh tổ chức cho hệ thống",
            "để phạm vi hệ thống được xây dựng và mô tả những gì nó phải làm"
        ],
        "image": null
    },
    {
        "text": "Đối tượng có dạng đa hình _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "có thể có cùng tên hoạt động nhưng các hoạt động thực hiện khác nhau",
            "phải có cùng thuộc tính",
            "chia sẻ tất cả các hoạt động giống nhau và các hoạt động thực hiện như nhau",
            "chỉ có thể được thực hiện thông qua các giao diện"
        ],
        "image": null
    },
    {
        "text": "Đó là cách thực hành tốt nhất cho các lớp có cấu trúc lồng nhau?",
        "numOfRightAnswer": 1,
        "answers": [
            "nên giới hạn việc lồng các lớp có cấu trúc ở hai mức trên mỗi sơ đồ",
            "nên hiển thị tất cả các lớp cấu trúc của một lớp có cấu trúc trong một để hiển thị độ sâu của các tương tác",
            "nên được giới hạn ở một mức độ sâu, do đó cho phép người dùng điều hướng từ sơ đồ này sang sơ đồ khác để hiển thị cấp độ tiếp theo",
            "nên được xác định bởi kiến trúc sư trong giai đoạn thiết kế"
        ],
        "image": null
    },
    {
        "text": "Trong quá trình phân tích kiến trúc, Kiến trúc sư phần mềm muốn giảm độ phức tạp của hệ thống tại nơi làm việc và cải thiện tính nhất quán của nó. Kiến trúc sư phần mềm nên định nghĩa gì để thực hiện điều này?",
        "numOfRightAnswer": 1,
        "answers": [
            "cơ chế phân tích",
            "quy tắc mã hóa",
            "thực hiện trường hợp sử dụng",
            "cơ chế thiết kế"
        ],
        "image": null
    },
    {
        "text": "Hai đối tượng nào có tất cả các đối tượng? (Chọn hai.)",
        "numOfRightAnswer": 2,
        "answers": [
            "trạng thái và hành vi",
            "một bản sắc duy nhất",
            "nguyên thủy",
            "giao diện"
        ],
        "image": null
    },
    {
        "text": "lớp phân tích phát triển thành _____. (Chọn hai.)",
        "numOfRightAnswer": 2,
        "answers": [
            "lớp thiết kế",
            "hệ thống con",
            "thực hiện trường hợp sử dụng",
            "gói thiết kế Kiến trúc E .."
        ],
        "image": null
    }
]