[
    {
        "text": "Phát biểu nào là đúng về các yếu tố trong hệ thống con và khả năng hiển thị công khai?",
        "numOfRightAnswer": 1,
        "answers": [
            "Phát biểu nào là đúng về các yếu tố trong hệ thống con và khả năng hiển thị công khai?",
            "Chỉ tập hợp con của các phần tử xác định API hệ thống con mới có khả năng hiển thị công khai.",
            "Chỉ có lớp proxy hệ thống con nên có khả năng hiển thị công khai.",
            "Chỉ các phần tử tham chiếu các lớp bên ngoài mới có khả năng hiển thị công khai."
        ],
        "image": null
    },
    {
        "text": "Hai loại phụ thuộc có thể được sử dụng từ một hệ thống con là gì?",
        "numOfRightAnswer": 2,
        "answers": [
            "<< uses >> phụ thuộc vào giao diện hệ thống con",
            "phụ thuộc << import >> vào gói chứa các lớp đã sử dụng",
            "mối quan hệ << manifest >> với một nút trong mô hình Triển khai",
            "mối quan hệ << nhận ra >> với một hoặc nhiều lần xuất hiện hợp tác"
        ],
        "image": null
    },
    {
        "text": "Nhiệm vụ nào được thực hiện trong quá trình sàng lọc thực hiện use case?",
        "numOfRightAnswer": 1,
        "answers": [
            "mô hình quan hệ lớp liên kết",
            "xác định các lớp tham gia",
            "phân bổ trách nhiệm giữa các lớp",
            "mô hình tin nhắn giữa các lớp"
        ],
        "image": null
    },
    {
        "text": "Phát biểu nào là đúng về thiết kế các hệ thống con?",
        "numOfRightAnswer": 1,
        "answers": [
            "Chúng đại diện cho một khả năng độc lập với giao diện rõ ràng.",
            "Chúng đóng gói một phần hành vi.",
            "Chúng mô hình hóa một biến thể hiện thực duy nhất.",
            "Chúng chỉ có thể chứa các lớp thiết kế."
        ],
        "image": null
    },
    {
        "text": "Cho cấu hình sau: Gói A, chứa lớp aClass thuộc tầng presentation. Gói B, chứa một lớp bClass và giao diện bInterface thuộc tầng business. Gói C, chứa cClass thuộc tầng data. Đâu là một thực hành kém?",
        "numOfRightAnswer": 1,
        "answers": [
            "aClass có một thuộc tính của loại cClass.",
            "aClass gọi một phương thức trong bClass.",
            "aClass nhận ra bInterface.",
            "bClass nhận ra bInterface"
        ],
        "image": null
    },
    {
        "text": "Tài liệu quy trình nào mô tả các cơ chế thiết kế, mọi ánh xạ giữa cơ chế thiết kế, và các chi tiết liên quan đến việc sử dụng chúng?",
        "numOfRightAnswer": 1,
        "answers": [
            "Tài liệu tầm nhìn",
            "Tài liệu kiến trúc phần mềm",
            "Hướng dẫn thiết kế",
            "Kế hoạch phát triển phần mềm"
        ],
        "image": null
    },
    {
        "text": "Xét trạng thái của trạng thái máy, hành vi có thể được xác định _____.",
        "numOfRightAnswer": 3,
        "answers": [
            "khi đạt đến một trạng thái",
            "khi rời khỏi một trạng thái",
            "trong một trạng thái",
            "trước khi đạt đến một trạng thái"
        ],
        "image": null
    },
    {
        "text": "Cổng là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "một tham số thể hiện một thông điệp vượt qua ranh giới của một đoạn tương tác hoặc tương tác",
            "một giao thức được xác định để truy cập vào bên trong của một hệ thống con",
            "một điểm quyết định trong một máy trạng thái có nhiều hơn hai phương án",
            "một tập hợp các điểm kiểm tra mỗi thiết kế hệ thống con phải đáp ứng trước khi có thể được chỉ định để thực hiện"
        ],
        "image": null
    },
    {
        "text": "Khi xác định các yếu tố thiết kế, một lớp phân tích đơn giản sẽ ánh xạ tới một _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "lớp thiết kế",
            "lớp hoạt động",
            "Giao diện ",
            "hệ thống con"
        ],
        "image": null
    },
    {
        "text": "Trong OOAD hoạt động là cơ chế phân phối được xác định?",
        "numOfRightAnswer": 1,
        "answers": [
            "Xác định cơ chế thiết kế",
            "Xác định các yếu tố thiết kế",
            "Thiết kế lớp",
            "Phân tích kiến trúc"
        ],
        "image": null
    },
    {
        "text": "E là gì trong hình vẽ dưới?",
        "numOfRightAnswer": 1,
        "answers": [
            "điều kiện bảo vệ",
            "fork",
            "quyết định",
            "sự biến đổi",
            "trạng thái cuối cùng",
            "Sự kiện",
            "trạng thái"
        ],
        "image": "https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F10_design.png?alt=media&token=bd84a09b-9f35-4531-b057-677f69f5ac76"
    },
    {
        "text": "Xác định các yếu tố thiết kế là một phần của chi tiết quy trình làm việc?",
        "numOfRightAnswer": 1,
        "answers": [
            "Tinh chỉnh kiến trúc",
            "Xác định kiến trúc ứng viên",
            "Thiết kế các thành phần ",
            "Thực hiện kiến trúc"
        ],
        "image": null
    },
    {
        "text": "H là gì trong hình vẽ dưới?",
        "numOfRightAnswer": 1,
        "answers": [
            "fork",
            "trạng thái ban đầu",
            "quyết định",
            "sự biến đổi",
            "trạng thái cuối cùng",
            "Sự kiện",
            "trạng thái",
            "điều kiện bảo vệ"
        ],
        "image": "https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F11_design.png?alt=media&token=f15bf927-10e0-4b10-885a-c5c1749bc4f6"
    },
    {
        "text": "Mối quan hệ giữa hành động và phương thức là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "Một phương thức mô tả cách một hành động được thực hiện.",
            "Các thuật ngữ đồng nghĩa.",
            "Một hành động mô tả cách thức thực hiện một phương thức.",
            "Không có mối quan hệ."
        ],
        "image": null
    },
    {
        "text": "Tại sao bạn sử dụng giao diện hệ thống con thay vì phiên bản hệ thống con trên sơ đồ trình tự?",
        "numOfRightAnswer": 1,
        "answers": [
            "để thực hiện các use case dễ dàng thay đổi",
            "để dễ dàng mô hình hóa các hệ thống con trong Thiết kế hệ thống con",
            "để dễ dàng bảo trì sơ đồ trình tự khi chữ ký tin nhắn thay đổi",
            "để giảm số lượng các lớp cần thiết để thực hiện hệ thống con"
        ],
        "image": null
    },
    {
        "text": "Đâu là một chế tác đầu vào cho hoạt động Xác định các yếu tố thiết kế?",
        "numOfRightAnswer": 1,
        "answers": [
            "Tài liệu kiến trúc phần mềm",
            "Mô hình triển khai",
            "Mô hình thực hiện",
            "Kiến trúc tham khảo"
        ],
        "image": null
    },
    {
        "text": "Đâu là một chế tác đầu vào cho hoạt động Xác định các yếu tố thiết kế?",
        "numOfRightAnswer": 1,
        "answers": [
            "Tài liệu kiến trúc phần mềm",
            "Mô hình triển khai",
            "Mô hình thực hiện",
            "Kiến trúc tham khảo"
        ],
        "image": null
    },
    {
        "text": "Một cân nhắc quan trọng khi phân bổ các quy trình cho các nút là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "giảm thiểu lưu lượng mạng",
            "giảm thiểu tiêu thụ điện năng",
            "sử dụng tất cả các nút có sẵn",
            "khoảng cách vật lý giữa các nút"
        ],
        "image": null
    },
    {
        "text": "Loại cơ chế nào là một đầu nối trên sơ đồ triển khai?",
        "numOfRightAnswer": 1,
        "answers": [
            "giao tiếp",
            "dự phòng",
            "giao dịch",
            "tính toán"
        ],
        "image": null
    },
    {
        "text": "Một cơ chế thiết kế _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "giả định một số chi tiết của môi trường thực hiện, nhưng không gắn liền với việc thực hiện cụ thể",
            "nắm bắt các khía cạnh chính của một giải pháp theo cách độc lập với việc thực hiện",
            "chỉ định thực hiện chính xác của cơ chế và bị ràng buộc với một công nghệ nhất định, thực hiệnngôn ngữ hoặc nhà cung cấp",
            "giống như một mẫu thiết kế"
        ],
        "image": null
    },
    {
        "text": "Khi xác định giao diện trong hoạt động Xác định thành phần thiết kế, Phát biểu nào là đúng?",
        "numOfRightAnswer": 1,
        "answers": [
            "Các giao diện nên được đóng gói riêng biệt với các yếu tố nhận ra chúng.",
            "Các lớp không nên nhận ra một giao diện.",
            "Mỗi hệ thống con chỉ nhận ra một giao diện.",
            "Các giao diện cần được xác định trước khi các hệ thống con được tạo."
        ],
        "image": null
    },
    {
        "text": "Các hệ thống con bổ sung có thể được phát hiện trong quá trình Thiết kế ca sử dụng bằng cách lưu ý",
        "numOfRightAnswer": 1,
        "answers": [
            "subflows chung giữa các đối tượng trên một số sơ đồ trình tự",
            "các đối tượng tương tự trên một số sơ đồ trình tự",
            "một chuỗi chuyển đổi trạng thái nhất quán cho nhiều lớp liên quan đến việc thực hiện ca sử dụng",
            "các lớp thiết kế giống nhau liên quan đến nhiều hơn một use case"
        ],
        "image": null
    },
    {
        "text": "Những hoạt động nào được thực hiện trong Thiết kế ca sử dụng?",
        "numOfRightAnswer": 1,
        "answers": [
            "mô tả hành vi liên quan đến persistence",
            "chuyển đổi các lớp phân tích thành các lớp thiết kế và các hệ thống con thiết kế",
            "mô tả các tương tác đối tượng thực hiện các hoạt động giao diện",
            "đơn giản hóa sơ đồ trình tự bằng cách sử dụng các lớp thiết kế"
        ],
        "image": null
    },
    {
        "text": "Trên sơ đồ trình tự, cái gì được sử dụng để thể hiện một hệ thống con cụ thể?",
        "numOfRightAnswer": 1,
        "answers": [
            "một thành phần hệ thống con",
            "một giao diện mà hệ thống con nhận ra",
            "một proxy hệ thống con",
            "một lớp hệ thống con"
        ],
        "image": null
    },
    {
        "text": "Các phần tử UML nào được sử dụng để mô tả kiến trúc vật lý của một hệ thống?",
        "numOfRightAnswer": 1,
        "answers": [
            "nút và đầu nối",
            "các lớp và các mối quan hệ",
            "đối tượng và tin nhắn",
            "hệ thống con và các phụ thuộc"
        ],
        "image": null
    },
    {
        "text": "Vật phẩm nào được sử dụng để mô tả hiện thực hóa use case?",
        "numOfRightAnswer": 1,
        "answers": [
            "sơ đồ giao tiếp",
            "mô tả use case văn bản",
            "biểu đồ trạng thái",
            "sơ đồ hoạt động"
        ],
        "image": null
    }
]