[
    {
        "text": "Đây là ví dụ về Môi trường thực thi?",
        "numOfRightAnswer": 1,
        "answers": [
            "Máy chủ ứng dụng J2EE",
            "Chuyển mạng Gigabit",
            "mạng riêng ảo",
            "máy tính cầm tay"
        ],
        "image": null
    },
    {
        "text": "Thiết kế ca sử dụng là phần nào  của quy trình công việc chi tiết?",
        "numOfRightAnswer": 3,
        "answers": [
            "Thành phần thiết kế",
            "Phân tích hành vi",
            "Nó cho thấy vai trò của lớp",
            "Lớp thiết kế và hệ thống con"
        ],
        "image": null
    },
    {
        "text": "Có bao nhiêu nút vật lý cần được xác định để thực hiện",
        "numOfRightAnswer": 1,
        "answers": [
            "nhiều hơn một nút",
            "không có nút nào",
            "chỉ một nút",
            "nút không hoặc một nút"
        ],
        "image": null
    },
    {
        "text": "Mục đích chính của hệ thống con thiết kế là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "đóng gói hành vi",
            "cung cấp quản lý cấu hình và tổ chức mô hình",
            "gói các lớp thiết kế tương tự với nhau",
            "đại diện cho hệ thống bên ngoài"
        ],
        "image": null
    },
    {
        "text": "Hiện vật nào được sử dụng để mô tả hiện thực hóa trường hợp sử dụng?",
        "numOfRightAnswer": 1,
        "answers": [
            "sơ đồ truyền thông",
            "mô tả trường hợp sử dụng văn bản",
            "biểu đồ trạng thái",
            "sơ đồ hoạt động"
        ],
        "image": null
    },
    {
        "text": "Các hệ thống con bổ sung có thể được phát hiện trong quá trình Thiết kế ca sử dụng bằng cách lưu ý",
        "numOfRightAnswer": 1,
        "answers": [
            "luồng con chung giữa các đối tượng trên một số sơ đồ trình tự",
            "các đối tượng tương tự trên một số sơ đồ trình tự",
            "một chuỗi chuyển đổi trạng thái nhất quán cho nhiều lớp liên quan đến việc thực hiện ca sử dụng",
            "các lớp thiết kế giống nhau liên quan đến nhiều hơn một trường hợp sử dụng"
        ],
        "image": null
    },
    {
        "text": "Mục đích của các lớp và các hệ thống con hợp nhất là để đảm bảo _____.",
        "numOfRightAnswer": 1,
        "answers": [
            "trách nhiệm của các yếu tố thiết kế không chồng chéo",
            "mỗi hệ thống con có một thành phần hệ thống con tương ứng",
            "tất cả các lớp được gán cho tối đa một hệ thống con",
            "mỗi giao diện được xác định có API gắn kết và mạch lạc"
        ],
        "image": null
    },
    {
        "text": "Ba mục đích của Thiết kế ca sử dụng là gì? (Chọn ba)",
        "numOfRightAnswer": 3,
        "answers": [
            "để tinh chỉnh việc thực hiện trường hợp sử dụng về mặt tương tác",
            "để tinh chỉnh các yêu cầu về hoạt động của các lớp thiết kế",
            "để tinh chỉnh các yêu cầu về hoạt động của các hệ thống con thiết kế và / hoặc giao diện của chúng",
            "để đảm bảo tính đầy đủ của sơ đồ Chế độ xem các lớp tham gia cho mỗi lần thực hiện ca sử dụng"
        ],
        "image": null
    },
    {
        "text": "Trên sơ đồ trình tự, cái gì được sử dụng để thể hiện một hệ thống con cụ thể?",
        "numOfRightAnswer": 1,
        "answers": [
            "một thành phần hệ thống con",
            "một giao diện mà hệ thống con nhận ra",
            "một proxy hệ thống con",
            "một lớp hệ thống con"
        ],
        "image": null
    },
    {
        "text": "Khi nào một lớp phân tích ánh xạ trực tiếp đến một lớp thiết kế?",
        "numOfRightAnswer": 1,
        "answers": [
            "khi lớp phân tích đại diện cho một sự trừu tượng logic duy nhất",
            "khi lớp phân tích sử dụng bản mẫu <entity>",
            "khi công cụ lập mô hình hỗ trợ chuyển đổi Mô hình phân tích thành Thiết kế",
            "khi một nhà phân tích có kỹ năng thiết kế mạnh mẽ"
        ],
        "image": null
    },
    {
        "text": "Đây là ví dụ về đầu nối?",
        "numOfRightAnswer": 1,
        "answers": [
            "Giao thức HTTP *",
            "Đĩa cứng SCSI",
            "Cung cấp điện liên tục",
            "Lớp JDBC"
        ],
        "image": null
    },
    {
        "text": "Chế độ xem 4 + 1 nào là trọng tâm của hoạt động Phân phối Mô tả?",
        "numOfRightAnswer": 1,
        "answers": [
            "Quan điểm triển khai",
            "Quan điểm logic",
            "Xem trường hợp sử dụng",
            "Quan điểm thực hiện"
        ],
        "image": null
    },
    {
        "text": "Sản phẩm đầu ra của Thiết kế ca sử dụng là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "Mô hình thiết kế",
            "lớp phân tích",
            "lớp thiết kế",
            "giao diện"
        ],
        "image": null
    },
    {
        "text": "Đâu là một thiết bị",
        "numOfRightAnswer": 1,
        "answers": [
            "máy tính cầm tay",
            "máy chủ cơ sở dữ liệu",
            "máy chủ web",
            "mạng riêng ảo"
        ],
        "image": null
    },
    {
        "text": "Thuộc tính được gạch chân chỉ ra điều gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "Thuộc tính được định nghĩa ở cấp phân loại thay vì cấp thể hiện.",
            "Thuộc tính là chỉ đọc",
            "Thuộc tính có nguồn gốc từ các thuộc tính khác.",
            "Thuộc tính xác định duy nhất các thể hiện"
        ],
        "image": null
    },
    {
        "text": "Đâu là một tạo phẩm đầu vào cho hoạt động Xác định các yếu tố thiết kế?",
        "numOfRightAnswer": 1,
        "answers": [
            "Tài liệu kiến trúc phần mềm",
            "Mô hình triển khai",
            "Mô hình thực hiện",
            "Kiến trúc tham khảo"
        ],
        "image": null
    },
    {
        "text": "Liên quan đến sự kiên trì, hai chức năng của giao dịch là gì? (Chọn hai.)",
        "numOfRightAnswer": 2,
        "answers": [
            "đảm bảo rằng một tập hợp các hoạt động được thực hiện hoặc hoàn toàn hoặc không",
            "đảm bảo rằng các bộ đối tượng chuyển từ trạng thái nhất quán này sang trạng thái nhất quán khác",
            "cho phép một nhà thiết kế xác định có chọn lọc các hoạt động sẽ được ưu tiên thực hiện khi thiếu tài nguyên hệ thống",
            "đơn giản hóa công việc thiết kế, do đó không cần phải xem xét một cách rõ ràng trong quá trình sử dụng Design Design",
	    "chỉ đơn giản là thiết kế công việc, bằng cách cung cấp các cách tiếp cận được tiêu chuẩn hóa để thể hiện các đối tượng liên tục trong UML"
        ],
        "image": null
    },

    {
        "text": "Trong hoạt động OOAD, đâu là cơ chế phân phối được xác định? ",
        "numOfRightAnswer": 1,
        "answers": [
            "Xác định cơ chế thiết kế",
            "Xác định các yếu tố thiết kế ",
            "Thiết kế lớp học ",
            "Phân tích kiến trúc"
        ],
        "image": null
    },
    {
        "text": "Mục đích của thiết kế hệ thống con là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "xác định các hành vi được chỉ định trong giao diện của hệ thống con về mặt cộng tác của các yếu tố thiết kế có chứa",
            "hoàn thiện các chi tiết của từng giao diện được các hệ thống con triển khai trong một ứng dụng",
            "chia hệ thống thành các hệ thống con để phân bổ các hệ thống con cho các nhóm phát triển",
            "xác định tầng nào mà mỗi hệ thống con sẽ được thực hiện và các cơ chế giao tiếp được sử dụng giữa chúng"
        ],
        "image": null
    },
    {
        "text": "Hai loại phụ thuộc có thể được sử dụng từ một hệ thống con là gì?",
        "numOfRightAnswer": 2,
        "answers": [
            "<< uses >> phụ thuộc vào giao diện hệ thống con",
            "phụ thuộc << import >> vào gói chứa các lớp đã sử dụng",
            "mối quan hệ << manifest >> với một nút trong mô hình Triển khai",
            "mối quan hệ << nhận ra >> với một hoặc nhiều lần xuất hiện hợp tác"
        ],
        "image": null
    },
    {
        "text": "Điều gì được sử dụng để mô tả quá trình áp dụng cơ chế phân phối",
        "numOfRightAnswer": 1,
        "answers": [
            "Mẫu UML và các bước được viết",
            "sơ đồ hoạt động",
            "lưu đồ",
            "sơ đồ ca sử dụng"
        ],
        "image": null
    },
    {
        "text": "Khi xác định giao diện trong hoạt động Xác định thành phần thiết kế, Phát biểu nào là đúng?",
        "numOfRightAnswer": 1,
        "answers": [
            "Các giao diện nên được đóng gói riêng biệt với các yếu tố nhận ra chúng.",
            "Các lớp không nên nhận ra một giao diện",
            "Mỗi hệ thống con chỉ nhận ra một giao diện. ",
            "Các giao diện cần được xác định trước khi các hệ thống con được tạo. "
        ],
        "image": null
    },
    {
        "text": "Ở trạng thái của máy trạng thái, hành vi có thể được xác định _____.",
        "numOfRightAnswer": 3,
        "answers": [
            "khi đạt đến một trạng thái",
            "khi rời khỏi một tiểu bang",
            "trong một trạng thái",
            "trước khi đạt đến một trạng thái"
        ],
        "image": null
    },

    {
        "text": "Tài liệu quy trình nào mô tả các cơ chế thiết kế, mọi ánh xạ giữa các cơ chế ",
        "numOfRightAnswer": 1,
        "answers": [
            "Tài liệu tầm nhìn",
            "Tài liệu kiến trúc phần mềm",
            "Hướng dẫn thiết kế",
            "Kế hoạch phát triển phần mềm"
        ],
        "image": null
    },
    {
        "text": "Trong Thiết kế hệ thống con, những gì xảy ra trong bước, Phân phối hệ thống con Trách nhiệm? ",
        "numOfRightAnswer": 1,
        "answers": [
            "Các trách nhiệm của hệ thống con được phân bổ cho các yếu tố thiết kế bên trong của nó",
            "Mỗi hệ thống con được kiểm tra để đảm bảo nó có một tập hợp trách nhiệm nhất quán và trách nhiệm không nhất quán được gán lại cho các hệ thống con khác. ",
            "Thư viện và API bên ngoài được xác định để nhận ra hành vi của hệ thống con.",
            "Cơ chế phân phối được chi tiết để lộ giao diện hệ thống con."
        ],
        "image": null
    },
    {
        "text": "Cổng là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "một tham số thể hiện một thông điệp vượt qua ranh giới của một đoạn tương tác hoặc tương tác",
            "một giao thức được xác định để truy cập vào bên trong của một hệ thống con",
            "một điểm quyết định trong một máy trạng thái có nhiều hơn hai phương án",
            "một tập hợp các điểm kiểm tra mỗi thiết kế hệ thống con phải đáp ứng trước khi có thể được chỉ định để thực hiện"
        ],
        "image": null
    },
    {
        "text": "Trong Thiết kế hệ thống con, có bao nhiêu sơ đồ tương tác (trình tự hoặc giao tiếp) nên được tạo ra?",
        "numOfRightAnswer": 1,
        "answers": [
            "ít nhất một sơ đồ tương tác cho mỗi hoạt động giao diện",
            "một sơ đồ tương tác trên mỗi thực hiện giao diện",
            "ít nhất một sơ đồ tương tác cho mỗi lần sử dụng giao diện bên ngoài",
            "một sơ đồ tương tác cho mỗi lớp thực hiện"
        ],
        "image": null
    },
    {
        "text": "Mối quan hệ giữa hoạt động và phương pháp là gì?",
        "numOfRightAnswer": 1,
        "answers": [
            "Một phương pháp mô tả cách một hoạt động được thực hiện.",
            "Các thuật ngữ đồng nghĩa.",
            "Các thuật ngữ đồng nghĩa.",
            "Không có mối quan hệ."
        ],
        "image": null
    }
]