[
    {
        "text":"Điều gì xác định trách nhiệm của hệ thống con?",
        "numOfRightAnswer":1,
        "answers":[
            "hành động của các giao diện mà nó thực hiện",
            "hành vi của lớp bên trong của nó",
            "việc thực hiện ca sử dụng trong đó hệ thống con xuất hiện",
            "các hoạt động trên một lớp có trong hệ thống con"
        ],
        "image":null
    },
    {
        "text":"Đâu là một cơ chế thiết kế?",
        "numOfRightAnswer":1,
        "answers":[
            "Gọi phương thức từ xa",
            "Persistency",
            "Cơ sở dữ liệu hướng đối tượng",
            "Phân phối"
        ],
        "image":null
    },
    {
        "text":"Để bắt đầu xác định các cơ chế thiết kế, bạn bắt đầu bằng cách phân loại cơ chế phân tích. Ba bước trong quy trình phân loại cơ chế phân tích là gì? (Chọn ba.)",
        "numOfRightAnswer":3,
        "answers":[
            "xác định hồ sơ đặc trưng cho từng cơ chế phân tích",
            "xác định khách hàng của từng cơ chế phân tích",
            "nhóm khách hàng theo cách sử dụng hồ sơ đặc trưng của họ",
            "chỉ định một nhà cung cấp thực hiện cho từng cơ chế phân tích"
        ],
        "image":null
    },
    {
        "text":"Trong Thiết kế hệ thống con, những gì xảy ra trong bước, Phân phối Trách nhiệm  hệ thống con?",
        "numOfRightAnswer":1,
        "answers":[
            "Các trách nhiệm của hệ thống con được phân bổ cho các yếu tố thiết kế bên trong của nó.",
            "Mỗi hệ thống con được kiểm tra để đảm bảo nó có một tập hợp trách nhiệm nhất quán và trách nhiệm không nhất quán được gán lại cho các hệ thống con khác.",
            "Thư viện và API bên ngoài được xác định để nhận ra hành vi của hệ thống con.",
            "Cơ chế phân phối được chi tiết để lộ giao diện hệ thống con."
        ],
        "image":null
    },
    {
        "text":"Thực thể nào có ranh giới và danh tính được xác định rõ ràng đóng gói trạng thái và hành vi?",
        "numOfRightAnswer":1,
        "answers":[
            "đối tượng",
            "Một lớp học",
            "thành phần",
            "gói"
        ],
        "image":null
    },
    {
        "text":"Mục đích của hoạt động Xác định cơ chế thiết kế là gì?",
        "numOfRightAnswer":1,
        "answers":[
            "tinh chỉnh các cơ chế phân tích thành các cơ chế thiết kế, dựa trên các ràng buộc áp đặt bởi môi trường thực hiện",
            "để tinh chỉnh các cơ chế phân tích và chỉ định thực hiện chính xác của cơ chế",
            "để cung cấp một tập hợp các dịch vụ được sử dụng bởi các đối tượng phân tích",
            "để xác định các trình giữ chỗ thiết kế trong kiến trúc để nỗ lực kiến trúc vẫn được chú trọng và ít có khả năng bị bỏ qua"
        ],
        "image":null
    },
    {
        "text":"Trong một phụ thuộc, thông qua tham chiếu nào mà lớp khách có thể nhìn thấy nhà cung cấp?",
        "numOfRightAnswer":3,
        "answers":[
            "tài liệu tham khảo local",
            "tài liệu tham khảo parameter",
            "tài liệu tham khảo global",
            "tham chiếu trường"
        ],
        "image":null
    },
    {
        "text":"Trong hoạt động Phân tích và Thiết kế, các hệ thống con được ánh xạ để phân tích các lớp?",
        "numOfRightAnswer":1,
        "answers":[
            "Xác định các yếu tố thiết kế",
            "Phân tích kiến trúc",
            "Xác định hệ thống con",
            "Kết hợp các yếu tố thiết kế hiện có"
        ],
        "image":null
    },
    {
        "text":"Yếu tố thiết kế nào được sử dụng để thể hiện một đối tượng đồng thời?",
        "numOfRightAnswer":1,
        "answers":[
            "active class",
            "capsule",
            "lớp thiết kế",
            "sự kiện"
        ],
        "image":null
    },
    {
        "text":"Hoạt động Mô tả Phân phối là nơi các quy trình được xác định trong Mô tả hoạt động Kiến trúc thực thi được phân bổ cho _____.",
        "numOfRightAnswer":1,
        "answers":[
            "node vật lý",
            "thành phần",
            "lớp",
            "hoạt động"
        ],
        "image":null
    },
    {
        "text":"Trong Thiết kế hệ thống con, có bao nhiêu sơ đồ tương tác (trình tự hoặc giao tiếp) nên được tạo ra?",
        "numOfRightAnswer":1,
        "answers":[
            "ít nhất một sơ đồ tương tác cho mỗi hành động giao diện",
            "một sơ đồ tương tác trên mỗi thực hiện giao diện",
            "ít nhất một sơ đồ tương tác cho mỗi lần sử dụng giao diện bên ngoài",
            "một sơ đồ tương tác cho mỗi lớp thực hiện"
        ],
        "image":null
    },
    {
        "text":"Một đồ thị có hướng của các nút được kết nối bởi các chuyển tiếp là sơ đồ _____.",
        "numOfRightAnswer":1,
        "answers":[
            "trạng thái máy",
            "giao tiếp",
            "trình tự",
            "thành phần"
        ],
        "image":null
    },
    {
        "text":"F là gì trong hình vẽ dưới?",
        "numOfRightAnswer":1,
        "answers":[
            "Sự kiện",
            "fork",
            "trạng thái ban đầu",
            "trạng thái ban đầu",
            "sự biến đổi",
            "trạng thái cuối cùng",
            "trạng thái",
            "điều kiện bảo vệ"
        ],
        "image":"https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F38_design.png?alt=media&token=40a54ff6-5c95-47b6-b3d2-239c7733fc23"
    },
    {
        "text":"Thiết kế ca sử dụng là một phần của chi tiết quy trình công việc?",
        "numOfRightAnswer":1,
        "answers":[
            "thiết kế Thành phần",
            "Các use case thiết kế",
            "Phân tích hành vi",
            "Lớp thiết kế và hệ thống con"
        ],
        "image":null
    },
    {
        "text":"Khi nào một lớp phân tích ánh xạ trực tiếp đến một lớp thiết kế?",
        "numOfRightAnswer":1,
        "answers":[
            "khi lớp phân tích đại diện cho một logic trừu tượng duy nhất",
            "khi lớp phân tích sử dụng bản mẫu <entity>",
            "khi công cụ lập mô hình hỗ trợ chuyển đổi Mô hình phân tích thành Thiết kế",
            "khi một nhà phân tích có kỹ năng thiết kế mạnh mẽ"
        ],
        "image":null
    },
    {
        "text":"Mục đích của thiết kế hệ thống con là gì?",
        "numOfRightAnswer":1,
        "answers":[
            "xác định các hành vi được chỉ định trong giao diện của hệ thống con về mặt cộng tác của các yếu tố thiết kế có chứa",
            "hoàn thiện các chi tiết của từng giao diện được các hệ thống con triển khai trong một ứng dụng",
            "chia hệ thống thành các hệ thống con để phân bổ các hệ thống con cho các nhóm phát triển",
            "xác định tầng nào mà mỗi hệ thống con sẽ được thực hiện và các cơ chế giao tiếp được sử dụng giữa chúng"
        ],
        "image":null
    },
    {
        "text":"Trong sơ đồ, C1 và C2 là gì?",
        "numOfRightAnswer":1,
        "answers":[
            "trạng thái",
            "fork",
            "trạng thái ban đầu",
            "quyết định",
            "sự biến đổi",
            "trạng thái cuối cùng",
            "Sự kiện",
            "điều kiện bảo vệ"
        ],
        "image":"https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F43_design.png?alt=media&token=6e69b590-222a-469d-a13a-5984bb57be2b"
    },
    {
        "text":"Xác định cấu hình mạng là bước _____ của Mô tả Hoạt động phân phối.",
        "numOfRightAnswer":1,
        "answers":[
            "đầu tiên",
            "trận chung kết",
            "thứ hai",
            "thứ năm"
        ],
        "image":null
    },
    {
        "text":"Trong sơ đồ, B là gì?",
        "numOfRightAnswer":1,
        "answers":[
            "trạng thái ban đầu",
            "fork",
            "quyết định",
            "sự biến đổi",
            "trạng thái cuối cùng",
            "Sự kiện",
            "trạng thái",
            "điều kiện bảo vệ"
        ],
        "image":"https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F45_design.png?alt=media&token=2eadfff5-e311-44a5-b381-1ab0cb8885e4"
    },
    {
        "text":"Phát biểu nào là đúng về các gói và hệ thống con?",
        "numOfRightAnswer":1,
        "answers":[
            "Một hệ thống con cung cấp hành vi.",
            "Một gói không thể chứa một hệ thống con.",
            "Một gói cung cấp hành vi.",
            "Bạn sử dụng một gói khi bạn cần đóng gói hành vi."
        ],
        "image":null
    },
    {
        "text":"Có bao nhiêu nút vật lý cần được xác định để thực hiện Mô tả hoạt động phân phối?",
        "numOfRightAnswer":1,
        "answers":[
            "nhiều hơn một nút",
            "không có nút nào",
            "chỉ một nút",
            "nút không hoặc một nút"
        ],
        "image":null
    },
    {
        "text":"Tài liệu sơ đồ trình tự bổ sung, dưới dạng ghi chú và tập lệnh, thường được sử dụng cho _____. (Chọn ba.)",
        "numOfRightAnswer":3,
        "answers":[
            "mô tả thời gian cần thiết giữa các tin nhắn",
            "cung cấp chi tiết về hành vi có điều kiện",
            "các điểm mở rộng tương quan trong use case với các vị trí cụ thể trong sơ đồ trình tự",
            "chỉ định các thuộc tính cho các đối tượng xuất hiện trong sơ đồ"
        ],
        "image":null
    },
    {
        "text":"Điều gì được sử dụng để mô tả quá trình áp dụng cơ chế phân phối Trong quá trình thực hiện?",
        "numOfRightAnswer":1,
        "answers":[
            "Mẫu UML và các bước được viết",
            "sơ đồ hoạt động",
            "lưu đồ",
            "sơ đồ ca sử dụng"
        ],
        "image":null
    },
    {
        "text":"Điều gì được sử dụng để mô tả quá trình áp dụng cơ chế phân phối Trong quá trình thực hiện?",
        "numOfRightAnswer":1,
        "answers":[
            "Animal có thể không có thể hiện trực tiếp nào.",
            "Lion và Tiger giao tiếp với nhau.",
            "Lion và Tiger giao tiếp với Animal.",
            "Thể hiện của Animal giao tiếp khác với trường hợp của Lion hoặc Tiger."
        ],
        "image":"https://firebasestorage.googleapis.com/v0/b/my-project-1564732530421.appspot.com/o/ooad%2F50.png?alt=media&token=771726d0-ff91-4169-8d14-70f01adae1fa"
    }
]